Repository: Esukhia/Corpora
Catalog: Parallel/84000/Toh_85-The_Question_of_Maitreya-v1.tmx
Source language: bo
Languages: en

source: ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ།
en: It is indeed good that you have thought of asking the Blessed One a question on this subject.

source: །བྱམས་པ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: Therefore, Maitreya, listen well and carefully, and retain all that I say in your mind.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: The bodhisattva mahāsattva Maitreya assented to the Blessed One, and listened as the Blessed One had instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One said,

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཞི་གནས་ཡོངས་སུ་ཚོལ་བ་དང་། ལྷག་མཐོང་ལ་མཁས་པ་སྟེ།
en: What two qualities? Thoroughly applying themselves in calm abiding and developing skill in insight.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཉིས་པོ་དེ་དག་དང་ལྡན་ན་
en: If bodhisattvas possess these two qualities,

source: ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: they will abandon all evil rebirths and not fall into the clutches of sinful associates, but swiftly realize supreme, perfect enlightenment and become a buddha.

source: གསུམ་གང་ཞེ་ན།
en: What three qualities?

source: སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་དང་།
en: Attaining great compassion and

source: སྟོང་པ་ཉིད་ཀྱི་ཆོས་ངེས་པར་སེམས་པ་དང་།
en: having definitive understanding of the teaching of emptiness,

source: དེས་ཀྱང་རློམ་སེམས་མི་བྱེད་པ་སྟེ།
en: yet without being arrogant.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་
en: Maitreya, if bodhisattvas possess these three qualities,

source: བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་
en: Furthermore, Maitreya, if bodhisattvas possess four qualities,

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་
en: Maitreya, if bodhisattvas possess these four qualities,

source: །བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལྔ་དང་ལྡན་ན་
en: Furthermore, Maitreya, if bodhisattvas possess five qualities,

source: ལྔ་གང་ཞེ་ན།
en: What five qualities?

source: སྟོང་པ་ཉིད་ལ་གནས་པ་དང་།
en: Dwelling in emptiness,

source: གཞན་དག་གི་འཁྲུལ་པ་མི་ཚོལ་བ་དང་།
en: not seeking the delusions of others,

source: བདག་ལྟ་རྟོག་པ་དང་།
en: investigating the self,

source: ཆོས་ལ་མངོན་པར་དགའ་བ་དང་།
en: delighting in the Dharma, and

source: གཞན་ལ་ཕན་འདོགས་པར་ཞུགས་པ་ཡིན་ཏེ།
en: being committed to helping others.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་
en: Maitreya, if bodhisattvas possess these five qualities,

source: བྱམས་པ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དྲུག་དང་ལྡན་ན་
en: Furthermore, Maitreya, if bodhisattvas possess six qualities,

source: དྲུག་གང་ཞེ་ན།
en: What six qualities?

source: བརྐམ་པ་མེད་པ་ཡིན། སྡང་བ་མེད་པ་ཡིན། རྨོངས་པ་མེད་པ་ཡིན།
en: Being without attachment, aversion, and ignorance;

source: དྲིས་མ་ཐག་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལན་ལྡོན་པ་ཡིན།
en: immediately answering questions correctly and properly;

source: བསྙེན་པར་དཀའ་བ་མེད་པ་ཡིན།
en: being tireless in their ritual observance;

source: སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ་ཡིན་ཏེ།
en: and experiencing emptiness.

source: བྱམས་པ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དྲུག་པོ་དེ་དག་དང་ལྡན་ན་
en: Maitreya, if bodhisattvas possess these six qualities,

source: བདུན་གང་ཞེ་ན།
en: What seven qualities?

source: དྲན་པ་ལ་མཁས་པ་ཡིན། ཆོས་ལ་མཁས་པ་ཡིན།
en: Being learned in mindfulness and in the Dharma.

source: བརྩོན་འགྲུས་བརྩམས་པ་ཡིན། དགའ་བ་ཐོབ་པ་ཡིན། ཤིན་ཏུ་སྦྱངས་པ་དང་ལྡན་པ་ཡིན།
en: Being diligent in their undertakings, joyful, mentally supple,

source: ཏིང་ངེ་འཛིན་ལ་མཁས་པ་ཡིན། ཤེས་རབ་ཀྱིས་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པ་ཡིན་ཏེ།
en: and skilled in meditative concentration and analysis through wisdom.

source: བརྒྱད་གང་ཞེ་ན།
en: What eight qualities?

source: ཡང་དག་པའི་ལྟ་བ་ཅན་ཡིན། ཡང་དག་པའི་རྟོག་པ་ཅན་ཡིན། ཡང་དག་པའི་ངག་ཅན་ཡིན། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཅན་ཡིན། ཡང་དག་པའི་འཚོ་བ་ཅན་ཡིན། ཡང་དག་པའི་རྩོལ་བ་ཅན་ཡིན། ཡང་དག་པའི་དྲན་པ་ཅན་ཡིན། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅན་ཡིན་ཏེ།
en: Possessing right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.

source: དགུ་གང་ཞེ་ན།
en: What nine qualities?

source: བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ།
en: Maitreya, those bodhisattvas distance themselves from desires and from sinful, non-virtuous things.

source: རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་
en: They investigate, examine, and possess the joy and happiness that arise from solitude.

source: བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Thus, they accomplish the first meditative absorption and maintain it.

source: །རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་རབ་ཏུ་དང་སྟེ།
en: They are free from thinking or examining, and possess inner serenity.

source: སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ།
en: Because their mindstreams are one-pointed, they do not think or examine.

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Endowed with the joy and happiness that arise from meditative concentration, they then accomplish the second meditative absorption and maintain it.

source: །དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས།
en: Because they are free from attachment to joy,

source: བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ།
en: they maintain equipoise and possess mindfulness and awareness.

source: བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ། འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ།
en: They experience the physical happiness of which the noble ones say, ‘To possess mindfulness and remain in happiness is equanimity.’

source: དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Free of joy they then accomplish the third meditative absorption and maintain it.

source: །བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན། སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ།
en: They renounce happiness after already renouncing suffering. Because both mental happiness and mental displeasure decline, there is neither happiness nor suffering.

source: བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: They then accomplish the fourth meditative absorption and maintain it, with immaculate equipoise and mindfulness.

source: རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ།
en: “They transcend conceptions of form in all aspects, and

source: ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་
en: their conceptions of materiality decline.

source: སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་
en: When they do not fabricate conceptions of any kind, they think, ‘This is the infinity of space,’

source: ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: and then accomplish the sphere of the infinity of space and maintain it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: After they have transcended the sphere of the infinity of space in all aspects,

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་
en: they think, ‘This is the infinity of consciousness,’

source: རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: and then accomplish the sphere of the infinity of consciousness and maintain it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: After they have transcended the sphere of the infinity of consciousness in all aspects,

source: ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: they think, ‘This is nothingness,’ and then accomplish the sphere of nothingness and maintain it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: After they have transcended the sphere of nothingness in all aspects, they then accomplish the sphere of neither perception nor non-perception and maintain it.

source: བཅུ་གང་ཞེ་ན།
en: What ten qualities?

source: རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། གནས་དང་གནས་མ་ཡིན་པ་ལ་མངོན་པར་བརྩོན་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། ཐབས་ཀྱིས་འགྲོ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། རྣམ་པར་སྣང་བྱེད་ཀྱི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། ཀུན་ནས་སྣང་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། ཀུན་དུ་གསལ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། རིན་ཆེན་ཟླ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། ཟླ་བ་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། ཉོན་མོངས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན། རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན་ཏེ།
en: Having vajra-like meditative concentration, meditative concentration that is assiduous regarding what is correct and incorrect, meditative concentration of going via methods, illuminating meditative concentration, all-illuminating meditative concentration, manifest meditative concentration, precious moon meditative concentration, moon-lamp meditative concentration, meditative concentration without afflictive emotions, and victory-banner finial meditative concentration.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: The bodhisattva mahāsattva Maitreya was then satisfied and delighted.

source: སྟན་ལས་ལངས་ནས་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: Joyful and pleased, he rose from his seat, draped his shawl over one shoulder, set his right knee on the ground, and

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: bowed to the Blessed One with joined palms.

source: བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: He praised the Blessed One with these fitting verses:

source: སྔོན་ཅད་སྦྱིན་པ་སྦྱིན་མཛད་པ།
en: In former times, you practiced generous giving.

source: །སྡུག་པའི་བུ་དང་ཟས་དང་སྐོམ། །མགོ་དང་མིག་ཀྱང་བཏང་མཛད་དེ།
en: Giving away dear sons, food and drink, And even your head and eyes,

source: །སངས་རྒྱས་སྦྱིན་ཀུན་ཕ་རོལ་ཕྱིན།
en: You perfected the total generosity of a buddha.

source: །གཡག་རྔ་བཞིན་དུ་ཡུན་རིང་ནས། །ཁྱོད་ཀྱིས་ཚུལ་ཁྲིམས་མ་ཉམས་བསྲུངས།
en: For a long time, like a yak its tail, You observed unimpaired moral conduct.

source: །ཁྲིམས་ཀྱིས་ཁྱོད་འདྲ་མ་མཆིས་ཏེ།
en: Peerless in your conduct,

source: །སངས་རྒྱས་ཁྲིམས་ལེགས་ཕ་རོལ་ཕྱིན།
en: You wholly perfected the conduct of a buddha.

source: །བཟོད་པའི་སྟོབས་ནི་བསྐྱེད་མཛད་ནས།
en: You generated the power of patience,

source: །བྱིས་པས་ནོངས་པ་བགྱིས་པ་བཟོད།
en: And patiently endured the wrong deeds of ignorant people.

source: །བཟོད་པའི་སྟོབས་རྣམས་ཀུན་དང་ལྡན།
en: Possessing all the powers of patience,

source: །སངས་རྒྱས་བཟོད་ལེགས་ཕ་རོལ་ཕྱིན།
en: You wholly perfected the patience of a buddha.

source: །བརྩོན་འགྲུས་སྟོབས་ནི་བསྐྱེད་མཛད་ནས།
en: You generated the power of diligence,

source: །ཞི་བདེ་བླ་ན་མེད་པ་བརྙེས།
en: Then found unsurpassed peace and happiness.

source: །བརྩོན་འགྲུས་སྟོབས་ཀྱིས་སྟོབས་དང་ལྡན།
en: Powerful due to your diligence,

source: །སངས་རྒྱས་བརྩོན་ལེགས་ཕ་རོལ་ཕྱིན།
en: You wholly perfected the diligence of a buddha.

source: ། སྡིག་པ་ཐམས་ཅད་བསྲེག་མཛད་ནས།
en: After burning up all sins,

source: །འདྲེན་པ་སྐྱེས་ཆེན་བསམ་གཏན་དགྱེས།
en: You, great guide and being, took pleasure in your meditation.

source: །བསམ་གཏན་སྟོབས་ཀྱིས་སྟོབས་དང་ལྡན།
en: Powerful due to the power of meditation,

source: །སངས་རྒྱས་བསམ་ལེགས་ཕ་རོལ་ཕྱིན།
en: You wholly perfected the meditation of a buddha.

source: །ཆོས་རྣམས་དེ་དག་རང་བཞིན་སྟོང་། །ངོ་བོ་ཉིད་ཀྱིས་གང་མི་སྐྱེ། །ཤེས་རབ་ཀྱིས་ནི་ཕ་རོལ་གཤེགས། །སངས་རྒྱས་ཤེས་ལེགས་ཕ་རོལ་ཕྱིན།
en: Through wisdom that realizes That phenomena are by nature empty And that nothing intrinsically arises, You reached the other shore and wholly perfected the wisdom of a buddha.

source: །མཁྱེན་ཆེན་བྱང་ཆུབ་ཤིང་དྲུང་དུ།
en: Wise One, beneath the Bodhi tree

source: །སྡེར་བཅས་བདུད་ནི་ཁྱོད་ཀྱིས་བཏུལ།
en: You subdued clawed demons

source: །དོན་གྱི་མཆོག་ཀྱང་བརྙེས་པར་གྱུར།
en: And attained the supreme goal.

source: །སངས་རྒྱས་བདུད་ཀྱི་ཚོགས་ངན་འཇོམས།
en: As the Buddha, you vanquished the evil gathering of demons.

source: །སྐྱེས་ཆེན་བཱ་ར་ཎཱ་སིར་ནི།
en: Great being, at Vārāṇasī

source: ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: You turned the wheel of the Dharma.

source: །མུ་སྟེགས་ཚོགས་ངན་སྐྲག་པར་མཛད།
en: You terrified the assembly of evil unbelievers,

source: །སངས་རྒྱས་མུ་སྟེགས་ཅན་ཚོགས་འཇོམས།
en: And, as the Buddha, vanquished the unbelievers’ gatherings.

source: །ཤེས་རབ་ཆེན་པོ་བླ་ན་མེད།
en: Unsurpassed for your vast wisdom,

source: །ཀུན་ནས་ཟླ་དཔེ་ཡོང་མ་མཆིས།
en: Utterly without compare,

source: །དཀོན་མཆོག་ཆོས་དེ་སྟོན་པར་མཛད།
en: You teach the Jewel of the Dharma,

source: །འདྲེན་པ་སངས་རྒྱས་འོད་མཛད་ལགས།
en: O guide and Buddha, you bring about illumination

source: །སྦྱིན་པ་དང་ནི་ཁྲིམས་སྟོབས་དང་། །བཟོད་བརྩོན་ཁྱོད་དང་འདྲ་མ་མཆིས།
en: You are peerless in generosity, Strength of moral conduct, patience, and diligence.

source: །ཀུན་གྱི་ཕ་རོལ་ཕྱིན་པར་གྱུར།
en: You have accomplished the perfection of everything.

source: །སངས་རྒྱས་ཡོན་ཏན་མང་པོས་འཕགས།
en: You excel, O Buddha, with your many qualities.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ
en: After the bodhisattva mahāsattva Maitreya had praised the Blessed One in verse with such fitting words, he stood to one side.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The venerable Ānanda then said to the Blessed One,

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་
en: Lord, Blessed One,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་འདི་འདི་ལྟར་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་དང་།
en: the bodhisattva mahāsattva Maitreya is so supremely eloquent,

source: འདི་ལྟར་ཤིན་ཏུ་རྣམ་པར་ངེས་པའི་ཚིག་གིས་ཆོས་སྟོན་པ་དང་།
en: and that he teaches the Dharma with such words of certainty,

source: འདི་ལྟར་ཚིག་དང་ཡི་གེ་མཚུངས་པའི་ཆོས་སྟོན་པ་དང་།
en: that he teaches the Dharma with such matching words and letters,

source: འདི་ལྟར་ཟབ་མོའི་ཚིག་གིས་ཆོས་སྟོན་པ་དང་།
en: that he teaches the Dharma with such profound words,

source: འདི་ལྟར་ལེགས་པར་འབྲེལ་པའི་ཚིག་གིས་ཆོས་སྟོན་པ་དང་།
en: that he teaches the Dharma with words that explain it so well, and

source: དྲན་པའི་ཚིག་གིས་ཆོས་སྟོན་པ་
en: that he teaches the Dharma with such memorable words.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ཀུན་དགའ་བོ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་
en: Formerly, Ānanda, in times gone by,

source: རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: endowed with perfect knowledge and perfect conduct,

source: བདེ་བར་གཤེགས་པ།
en: established in a state of bliss,

source: འཇིག་རྟེན་མཁྱེན་པ།
en: commanding all worldly knowledge,

source: སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ།
en: an unsurpassed guide who converted all beings,

source: ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: a teacher of gods and men,

source: བསྐལ་པ་གྲངས་མེད་པ་བཅུར་ཚང་བར་གྱུར་པ་དེའི་ཚེ་དེའི་དུས་ན་
en: at a time when ten countless ages had passed,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས།
en: a tathāgata, arhat, completely and perfectly enlightened buddha,

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་ཞེས་བྱ་བ་
en: the Buddha Arhat named Jyoti­vikrīḍitābhijña.

source: འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: came into the world

source: དེའི་ཚེ་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ཅེས་བྱ་བ་གཟུགས་བཟང་བ།
en: At that time, there lived a brahmin boy named Bhadraśuddha, good-looking,

source: མཛེས་པ།
en: handsome,

source: བལྟ་ན་སྡུག་པ།
en: and beautiful to behold,

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་ཡོད་པ་དེ་སྐྱེད་མོས་ཚལ་དུ་འགྲོ་སྟེ།
en: endowed with a supremely good complexion and excellent figure. He was going to a pleasure grove,

source: གྲོང་བར་དུ་ཕྱིན་པ་དང་།
en: when between the villages

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་མཛེས་པ།
en: he saw the Tathāgata, the Arhat, the completely and perfectly enlightened Buddha Jyoti­vikrīḍitābhijña. The Tathāgata was handsome

source: དད་པར་བྱ་བ།
en: and charismatic,

source: དབང་པོ་ཞི་བ། ཐུགས་ཞི་བ།
en: controlled in his faculties and in his mind.

source: དུལ་བ་དང་ཞི་གནས་ཀྱི་མཆོག་བརྙེས་པ། དུལ་བ་དང་ཞི་གནས་ཀྱི་དམ་པ་བརྙེས་པ།
en: He had attained excellence in control and calm abiding, and superiority in control and calm abiding.

source: དབང་པོ་བསྲུངས་པ།
en: He guarded his faculties,

source: གླང་པོ་ཆེ་དབང་པོ་ཐུལ་བ་ལྟ་བུ།
en: elephant-like in control of his passions,

source: མཚོ་ལྟར་དང་ཞིང་རྙོག་པ་མེད་ལ་གསལ་བ།
en: and was radiant, unsullied, and clear like a lake.

source: སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་པོ་དག་གིས་སྐུ་ལེགས་པར་བརྒྱན་པ། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་པོ་དག་གིས་སྐུ་རྣམ་པར་སྤྲས་པ།
en: His body was adorned with the thirty-two marks of a great being, and with the eighty minor marks,

source: ཤིང་སཱ་ལའི་རྒྱལ་པོ་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་འདྲ་བ།
en: like the blossoming flower of a royal sal tree,

source: རིའི་རྒྱལ་པོ་རི་རབ་ལྟར་མངོན་པར་འཕགས་པ།
en: and towering like Mount Meru, the king of mountains.

source: ཤིང་ནྱ་གྲོ་དྷ་ལྟར་ཆུ་ཞེང་གབ་པ་འོད་འབར་བའི་སྐུ་དཔལ་ཆེན་པོས་འབར་བ་
en: His body was proportioned like a nyagrodha tree, blazing with light and great splendor.

source: །མཐོང་ནས་ཀྱང་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དད་པར་གྱུར་ཏོ།
en: Seeing him, Bhadraśuddha developed an attitude of faith toward the Blessed One.

source: །དེ་སེམས་དད་ནས་འདི་སྙམ་དུ་སེམས་ཏེ།
en: With this attitude of faith, he thought,

source: ཨ་ལ་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་འདི་རྣམ་པར་སྤྲས་ཤིང་ཁ་དོག་དང་གཟི་བརྗིད་དང་། དཔལ་དང་མཚན་རྣམས་ཀྱིས་འབར་ཞིང་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་བ་ངོ་མཚར་ཏོ།
en: ‘How marvelous! How wondrously this body of the Tathāgata is adorned in its complexion and splendor. It blazes with glory, the marks of buddhahood, and clear, brilliant radiance.’

source: དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་གིས་འདི་སྐད་ཅེས་སྨྲས་ཏེ།
en: The brahmin boy Bhadraśuddha then spoke out loud,

source: ཨ་ལ་ལ་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་ལུས་འདི་འདྲ་བ་དང་ལྡན་པར་གྱུར་ཅིག་ཁ་དོག་དང་། གཟི་བརྗིད་དང་། དཔལ་དང་།
en: How marvelous! May I also, in the future, come to possess such a body, blazing like this in complexion, magnificence, splendor,

source: མཚན་རྣམས་ཀྱིས་འདི་ལྟར་འབར་ཞིང་ལྷམ་མེ་ལྷན་ནེ་ལྷང་ངེ་བར་གྱུར་ཅིག་ཅེས་
en: the marks of buddhahood, and with clear, brilliant radiance!’

source: དེས་སྨོན་ལམ་དེ་སྐད་བཏབ་ནས་ས་ལ་ཉལ་ཏེ་འདི་སྙམ་དུ་བསམས་སོ།
en: After he had prayed thus, he lay on the ground and thought,

source: །ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་དེས་
en: Then, Ānanda, the Tathāgata, the Arhat, the completely and perfectly enlightened Buddha Jyoti­vikrīḍitābhijña,

source: བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་གི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ག་ལ་བ་དེར་གཤེགས་ཏེ།
en: learning of the noble intention of the brahmin boy Bhadraśuddha, approached him and

source: བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ལ་ཞབས་ཀྱིས་རེག་པར་མཛད་དོ།
en: touched him with his foot.

source: དེ་བཞིན་གཤེགས་པ་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་དེས་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ལ་ཞབས་ཀྱིས་རེག་པར་མཛད་མ་ཐག་ཏུ།
en: As soon as the Tathāgata Jyoti­vikrīḍitābhijña had touched the brahmin boy Bhadraśuddha with his foot,

source: དེ་ནས་དེའི་ཚེ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ།
en: at that very moment the boy attained acceptance of the fact that all phenomena are unproduced.

source: །ཀུན་དགའ་བོ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྣང་བས་རྣམ་པར་རོལ་པའི་མངོན་པར་ཤེས་པ་དེས་སྣམ་ལོགས་སུ་གཟིགས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Ānanda, the Tathāgata Jyoti­vikrīḍitābhijña looked behind him and addressed the monks,

source: དགེ་སློང་དག་ཁྱེད་གང་གིས་ཀྱང་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་དེའི་ལུས་ལ་རྐང་པས་མ་རྫི་ཤིག
en: Monks, on no account should you tread on the brahmin boy Bhadraśuddha with your feet.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why?

source: ། ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་བསྐོར་ཏེ་བཙལ་བགྱིས་ཀྱང་།
en: ‘Though I roamed and searched in all the cardinal and intermediate directions,

source: །འཇིག་རྟེན་དག་ན་མི་དབང་ཁྱོད་འདྲ་ཡོད་མ་མཆིས།
en: There is no lord such as you in all the worlds.

source: །འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་འོད་ཀྱིས་ལྷམ་མེར་གྱུར།
en: Illuminates all these worlds with its light,

source: །སངས་རྒྱས་ཡོན་ཏན་གཟི་མངའ་ཁྱོད་ལ་བདག་ཕྱག་འཚལ།
en: So do your splendid qualities—O Buddha, to you I pay homage.

source: །ཇི་ལྟར་སེང་གེ་ནགས་ཁྲོད་དག་ན་སྒྲ་སྒྲོགས་པ།
en: Just as a lion roaring in the deep forests

source: །ཝ་ཚོགས་ཕལ་ཆེན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་བགྱིད།
en: Subdues the fox and all other ordinary animals,

source: །དེ་ལྟར་མི་ཡི་དམ་པ་མཐུ་ཆེན་མངའ་བ་ཡང་།
en: So you, the noblest and most powerful of men,

source: །མུ་སྟེགས་ཅན་མང་འདུས་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན།
en: Subdue all the great assemblies of unbelievers.

source: །བདེ་བར་གཤེགས་པ་སྨིན་མཚམས་བར་གྱི་མཛོད་སྤུ་དཀར།
en: The Sugata’s fair ringlet between his eyebrows,

source: ། དངུལ་དང་ཁ་བའི་ཚོགས་བཞིན་མཐའ་ཡས་གཟི་བརྗིད་ཅན།
en: Endlessly splendid like a hoard of silver or snow,

source: །དེས་ནི་འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་སྣང་བར་བགྱིས།
en: Illuminates all these worlds.

source: །འཇིག་རྟེན་ཀུན་ན་སངས་རྒྱས་ཁྱོད་ནི་མི་མཉམ་མཉམ།
en: In all the worlds there is nobody who equals you, O Buddha.

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་ཞབས་ལ་ལྷ་ཡི་འཁོར་ལོ་མངའ། །གསལ་ཞིང་མཛེས་ལ་རྩིབས་སྟོང་ཚང་ཞིང་མུ་ཁྱུད་འཁོར།
en: Best of beings, you possess celestial wheels Bright and fair, with a thousand spokes and spinning rims, On your feet:

source: །དེ་དག་གིས་ནི་རི་དང་ནགས་བཅས་ས་འདི་རྣམས། །རབ་ཏུ་གཡོ་བགྱིད་
en: these marks cause the earth, with its mountains and forests, to tremble.

source: ཐུབ་པ་གང་ཟག་མཚུངས་མེད་པ།
en: O Sage, you are unrivaled by ordinary beings.

source: །ཉོན་མོངས་ཤས་ཆེན་དོར་བར་བགྱི་བ་ཐམས་ཅད་བོར།
en: Your great knowledge discards afflictive emotions and abandons everything.

source: །ཡོན་ཏན་ཀུན་ལ་མངའ་བརྙེས་ཚུལ་ཁྲིམས་རྣམ་དག་པ།
en: You have obtained mastery of all good qualities, and your moral conduct is pure.

source: །ཇི་ལྟར་ནམ་མཁར་ལག་པ་མི་ཐོགས་མི་ཆགས་ལྟར།
en: Just as hands cannot grasp or capture space,

source: །འཇིག་རྟེན་དག་ན་ཁྱོད་ལ་རྗེས་ཆགས་ཁྲོ་མི་མངའ།
en: in the worlds you possess no attachment or anger.

source: །བཟོད་པ་ཟད་ཀྱིས་གཏུགས་པ་དོན་དང་ཆོས་རྣམས་ཀུན། །སྙིང་པོ་མ་མཆིས་པ་དང་གསོབ་དང་གསོག་ཏུ་མཁྱེན།
en: Reaching ultimate acceptance, you learnt that all objects and phenomena Are without essence, fictitious, and impure.

source: །སྲིད་པའི་འགྲོ་བ་ཐམས་ཅད་དག་ན་གང་རྣམས་ལ། །རློམ་སེམས་འགྱུར་བའི་སེམས་ཅན་སྲོག་དང་དངོས་མ་བརྙེས།
en: In all those arrogant sentient beings that migrate in saṃsāra, You found no life force or substance.

source: །ཁམས་དང་སྤྱོད་པ་དག་དང་སྦྱོར་དང་བསམ་པ་མཁྱེན།
en: Adapting to their dispositions and actions, and knowing their thoughts,

source: །རྨད་དུ་བྱུང་དང་རྣམ་པར་འབྱེད་མཛད་སྒྲོན་མར་གྱུར།
en: You are a wondrous lamp that discerns them.

source: །ཆུ་བོ་ཆེན་པོས་དེད་པའི་འགྲོ་བ་གཟིགས་གྱུར་ནས།
en: Since you witnessed beings carried away by the great river,

source: །སྔོན་ཆད་བརྩོན་འགྲུས་སྟོབས་བརྟན་མཐུ་ནི་བསྐྱེད་པ་མཛད།
en: You formerly produced the power of firm strength of diligence.

source: །སྐྱེ་བ་སྤངས་ཤིང་ཉོན་མོངས་ཞི་བའི་ཐུགས་དང་ལྡན།
en: You possess a mind that rejects rebirth and pacifies afflictive emotions;

source: །ཐུགས་རྒྱ་ཆེན་པོ་སྐྱེ་དང་རྒ་ཤི་མཐའ་མར་འབྱིན།
en: Your vast mind brought birth, old age, and death to an end.

source: །ནམ་མཁའི་དཀྱིལ་དང་མཚུངས་པར་ཆགས་པ་མི་མངའ་རྒྱུ།
en: Like the sphere of space you are without attachment;

source: །འཇིག་རྟེན་ཆོས་ཀྱིས་མི་གོས་འཇིག་རྟེན་གསུམ་ན་རྒྱུ།
en: Untainted by worldly qualities, you roam the three worlds.

source: །བདག་ཉིད་ཆེན་པོ་ཤེས་རབ་ཀྱིས་ནི་སྣང་བར་མཛད།
en: O great being, your wisdom brings illumination,

source: །མུན་པ་མུན་གནག་གྱུར་པ་ཐམས་ཅད་རྣམ་པར་སེལ།
en: Dispelling every darkness that has gathered.

source: །འདོད་ཆགས་རྡུལ་ཞི་མཛད་ཅིང་ཞེ་སྡང་གཏི་མུག་གི །དྲི་མ་སྣ་ཚོགས་མུན་བསལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: You calm the dust of attachment and dispel the darkness Of the various stains of anger and ignorance—to you I pay homage.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་འདི་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་བཟང་དག་ཅེས་བྱ་བར་གྱུར་ཏེ།
en: Because the bodhisattva mahāsattva Maitreya himself was then, at that time, the brahmin boy Bhadraśuddha,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The venerable Ānanda asked
